//-----------------------------------------------------------
//CLASS_ACTIVE_BLOCK
//-----------------------------------------------------------
#ifndef CLASS_ACTIVE_BLOCK
#define CLASS_ACTIVE_BLOCK
//--------------------------------------
//システムインクルード
#include "Sys_Include.h"
//--------------------------------------
//マスターズインクルード
#include "C_Block.h"
//--------------------------------------
//インスタンスインクルード
//--------------------------------------
//マネージャーインクルード
//--------------------------------------
//マクロ定義
//--------------------------------------
//構造体宣言
typedef enum
{
	ACTIVE_BLOCK_STATS_SELECTING = 0,	
	ACTIVE_BLOCK_STATS_CREATE,
	ACTIVE_BLOCK_STATS_DELETE,
	ACTIVE_BLOCK_STATS_MAX,
}ACTIVE_STATS;
//--------------------------------------
//クラス宣言
class c_Active_Block : public c_Block
{

public:
			c_Active_Block();
			~c_Active_Block();
	void	InitActiveBlock(void);
	void	UpdateActiveBlock(D3DXVECTOR3 CenterPos);
	void	UninitActiveBlock(void);
	int		GetActiveBlockStats(void);
	D3DXVECTOR3			m_vCenterPos;
private:
	int					m_nActiveStats;
	
	
};
//--------------------------------------
//オブジェクトグローバル変数宣言
//--------------------------------------
//係数グローバル変数宣言
//--------------------------------------
//プロトタイプ宣言
//--------------------------------------
//初期化処理
//--------------------------------------
//終了処理
//--------------------------------------
//更新処理
//--------------------------------------
//描画処理
#endif
//-----------------------------------------------------------
//End of File
//-----------------------------------------------------------