//-----------------------------------------------------------
//CLASS_Camera_MANAGER_H
//-----------------------------------------------------------
#ifndef CLASS_Camera_MANAGER_H
#define CLASS_Camera_MANAGER_H
//--------------------------------------
//システムインクルード
#include "Sys_Include.h"
//--------------------------------------
//マスターズインクルード
#include "Sys_C_Camera.h"
//--------------------------------------
//インスタンスインクルード
//--------------------------------------
//マネージャーインクルード
//--------------------------------------
//マクロ定義
//--------------------------------------
//構造体宣言
//--------------------------------------
//クラス宣言
class c_Camera_Mgr
{
typedef enum
{
	CAMERA_MAIN = 0,
	CAMERA_MAX,
}CAMERA_NAME;
public:
	c_Camera_Mgr();												// コンストラクタ　
	void	Init_CameraMgr(void);								// 初期化
	void	Uninit_CameraMgr(void);								// 開放
	void	Update_CameraMgr(void);								// 更新
	void	Draw_CameraMgr(void);								// 描画

	c_Camera*				m_pSysCamera[CAMERA_MAX];			// システム上のライトナンバー
};
//--------------------------------------
//オブジェクトグローバル変数宣言
//--------------------------------------
//係数グローバル変数宣言
//--------------------------------------
//プロトタイプ宣言
//--------------------------------------
//初期化処理
//--------------------------------------
//終了処理
//--------------------------------------
//更新処理
//--------------------------------------
//描画処理
#endif
//-----------------------------------------------------------
//End of File
//-----------------------------------------------------------
