//-----------------------------------------------------------
//CLASS_TEST_MANAGER_H
//-----------------------------------------------------------
#ifndef CLASS_TEST_MANAGER_H
#define CLASS_TEST_MANAGER_H
//--------------------------------------
//システムインクルード
#include "Sys_Include.h"
//--------------------------------------
//マスターズインクルード
#include "C_UI_MessageBox.h"
//--------------------------------------
//インスタンスインクルード



//--------------------------------------
//マネージャーインクルード
#include "C_Light_Mgr.h"
//--------------------------------------
//マクロ定義
//--------------------------------------
//構造体宣言
//--------------------------------------
//クラス宣言
class c_Test_Mgr
{
public:
	c_Test_Mgr();									// コンストラクタ―
	void Init_Test_Mgr(void);						// 初期化処理
	void Update_Test_Mgr(void);						// 更新処理
	void Uninit_Test_Mgr(void);						// 開放処理
	void Draw_Test_Mgr(void);						// 描画処理
	void UseTestMgr(bool bInput);					// テストマネージャのON/OFF
	bool GetTestMgrUse(void);						// テストマネージャの取得
private:
	bool						m_bTestVersion;		// テストMGR起用するか
	c_UI_MessageBox*			m_pTestMessage;		// テスト用のメッセージボックス
};

//--------------------------------------
//オブジェクトグローバル変数宣言
//--------------------------------------
//係数グローバル変数宣言
//--------------------------------------
//プロトタイプ宣言
//--------------------------------------
//初期化処理
//--------------------------------------
//終了処理
//--------------------------------------
//更新処理
//--------------------------------------
//描画処理
#endif
//-----------------------------------------------------------
//End of File