//-----------------------------------------------------------
//SYS_CLASS_MESSANGER
//-----------------------------------------------------------
#ifndef SYS_CLASS_MESSANGER_H
#define SYS_CLASS_MESSANGER_H
//--------------------------------------
//システムインクルード
#include "Sys_Include.h"
#include "Sys_C_Font.h"
//--------------------------------------
//マスターズインクルード
//--------------------------------------
//インスタンスインクルード
//--------------------------------------
//マネージャーインクルード
//--------------------------------------
//マクロ定義
//--------------------------------------
//構造体宣言
//--------------------------------------
//クラス宣言
class c_Messenger
{
#define MAX_TEXT	(128)
public:
	c_Messenger();
	~c_Messenger();
	LPCSTR Update_MessengerLPC(void);
	void Draw_MessengerInfo(void);
private:

	char			m_cMessage[MAX_TEXT];
	LPCSTR			m_lpMessage;
	c_Font			m_cFont;
	char			m_cInput;
	int				key;

};
//--------------------------------------
//オブジェクトグローバル変数宣言
//--------------------------------------
//係数グローバル変数宣言
//--------------------------------------
//プロトタイプ宣言
//--------------------------------------
//初期化処理
//--------------------------------------
//終了処理
//--------------------------------------
//更新処理
//--------------------------------------
//描画処理
#endif
//-----------------------------------------------------------
//End of File
//-----------------------------------------------------------